PGM PARM(&A &B &RESULT)

  DCL VAR(&A) TYPE(*DEC) LEN(10 0)
  DCL VAR(&B) TYPE(*DEC) LEN(10 0)
  DCL VAR(&RESULT) TYPE(*DEC) LEN(10 0)

  CHGVAR VAR(&RESULT) VALUE(&A * &B)

ENDPGM
